experiment-data/k0s/dp_redis_density/dp_redis_density/output1/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets         1562.97          ---          ---        11.61797         9.79100        53.75900       112.12700       120.40 
Gets        15628.08         3.00     15625.08        11.61675         9.79100        53.50300       112.12700       608.86 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals      17191.05         3.00     15625.08        11.61686         9.79100        53.50300       112.12700       729.26 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.247        0.000
SET       3.023        5.000
SET       4.575       10.000
SET       5.695       15.000
SET       6.527       20.000
SET       7.007       25.000
SET       7.615       30.000
SET       8.159       35.000
SET       8.767       40.000
SET       9.215       45.000
SET       9.791       50.000
SET      10.047       52.500
SET      10.367       55.000
SET      10.623       57.500
SET      10.943       60.000
SET      11.263       62.500
SET      11.647       65.000
SET      12.031       67.500
SET      12.415       70.000
SET      12.927       72.500
SET      13.375       75.000
SET      13.631       76.250
SET      13.951       77.500
SET      14.271       78.750
SET      14.655       80.000
SET      15.039       81.250
SET      15.423       82.500
SET      15.871       83.750
SET      16.383       85.000
SET      16.895       86.250
SET      17.535       87.500
SET      17.919       88.125
SET      18.175       88.750
SET      18.687       89.375
SET      19.071       90.000
SET      19.455       90.625
SET      19.967       91.250
SET      20.479       91.875
SET      21.119       92.500
SET      21.759       93.125
SET      22.527       93.750
SET      22.911       94.062
SET      23.295       94.375
SET      23.807       94.688
SET      24.319       95.000
SET      24.831       95.312
SET      25.471       95.625
SET      26.239       95.938
SET      27.007       96.250
SET      27.903       96.562
SET      29.055       96.875
SET      29.567       97.031
SET      30.335       97.188
SET      31.103       97.344
SET      31.999       97.500
SET      33.023       97.656
SET      34.047       97.812
SET      35.327       97.969
SET      36.863       98.125
SET      38.399       98.281
SET      40.703       98.438
SET      41.983       98.516
SET      43.263       98.594
SET      45.055       98.672
SET      46.591       98.750
SET      48.383       98.828
SET      50.687       98.906
SET      53.247       98.984
SET      55.807       99.062
SET      58.623       99.141
SET      61.439       99.219
SET      63.231       99.258
SET      64.767       99.297
SET      66.559       99.336
SET      68.607       99.375
SET      70.655       99.414
SET      72.703       99.453
SET      74.751       99.492
SET      77.311       99.531
SET      79.359       99.570
SET      81.919       99.609
SET      82.943       99.629
SET      84.479       99.648
SET      86.015       99.668
SET      87.551       99.688
SET      88.575       99.707
SET      90.111       99.727
SET      91.647       99.746
SET      93.695       99.766
SET      95.743       99.785
SET      97.791       99.805
SET      98.815       99.814
SET      99.839       99.824
SET     101.375       99.834
SET     102.399       99.844
SET     103.423       99.854
SET     104.959       99.863
SET     107.007       99.873
SET     108.543       99.883
SET     110.591       99.893
SET     112.639       99.902
SET     113.151       99.907
SET     114.687       99.912
SET     115.711       99.917
SET     116.735       99.922
SET     118.271       99.927
SET     119.295       99.932
SET     120.831       99.937
SET     122.367       99.941
SET     124.415       99.946
SET     126.463       99.951
SET     127.487       99.954
SET     128.511       99.956
SET     130.047       99.958
SET     131.071       99.961
SET     132.095       99.963
SET     133.119       99.966
SET     134.143       99.968
SET     135.167       99.971
SET     137.215       99.973
SET     140.287       99.976
SET     140.287       99.977
SET     142.335       99.978
SET     143.359       99.979
SET     144.383       99.980
SET     145.407       99.982
SET     147.455       99.983
SET     148.479       99.984
SET     150.527       99.985
SET     152.575       99.987
SET     154.623       99.988
SET     155.647       99.988
SET     156.671       99.989
SET     158.719       99.990
SET     160.767       99.990
SET     161.791       99.991
SET     162.815       99.991
SET     164.863       99.992
SET     166.911       99.993
SET     168.959       99.993
SET     173.055       99.994
SET     174.079       99.994
SET     175.103       99.995
SET     177.151       99.995
SET     177.151       99.995
SET     179.199       99.995
SET     179.199       99.996
SET     181.247       99.996
SET     183.295       99.996
SET     190.463       99.997
SET     195.583       99.997
SET     196.607       99.997
SET     201.727       99.997
SET     201.727       99.997
SET     206.847       99.998
SET     207.871       99.998
SET     207.871       99.998
SET     208.895       99.998
SET     209.919       99.998
SET     209.919       99.998
SET     210.943       99.998
SET     217.087       99.999
SET     217.087       99.999
SET     217.087       99.999
SET     221.183       99.999
SET     221.183       99.999
SET     221.183       99.999
SET     223.231       99.999
SET     230.399       99.999
SET     236.543       99.999
SET     236.543       99.999
SET     237.567       99.999
SET     237.567       99.999
SET     237.567       99.999
SET     239.615       99.999
SET     239.615       99.999
SET     239.615       99.999
SET     240.639      100.000
SET     240.639      100.000
SET     243.711      100.000
SET     243.711      100.000
SET     243.711      100.000
[...]
SET     245.759      100.000
SET     245.759      100.000
SET     245.759      100.000
[...]
SET     290.815      100.000
SET     290.815      100.000
---
GET       0.215        0.000
GET       3.023        5.000
GET       4.575       10.000
GET       5.663       15.000
GET       6.527       20.000
GET       7.007       25.000
GET       7.615       30.000
GET       8.159       35.000
GET       8.767       40.000
GET       9.215       45.000
GET       9.791       50.000
GET      10.047       52.500
GET      10.303       55.000
GET      10.623       57.500
GET      10.943       60.000
GET      11.263       62.500
GET      11.647       65.000
GET      12.031       67.500
GET      12.415       70.000
GET      12.927       72.500
GET      13.375       75.000
GET      13.631       76.250
GET      13.951       77.500
GET      14.271       78.750
GET      14.655       80.000
GET      15.039       81.250
GET      15.423       82.500
GET      15.871       83.750
GET      16.383       85.000
GET      17.023       86.250
GET      17.535       87.500
GET      17.919       88.125
GET      18.303       88.750
GET      18.687       89.375
GET      19.071       90.000
GET      19.455       90.625
GET      19.967       91.250
GET      20.479       91.875
GET      21.119       92.500
GET      21.759       93.125
GET      22.527       93.750
GET      22.911       94.062
GET      23.295       94.375
GET      23.807       94.688
GET      24.319       95.000
GET      24.959       95.312
GET      25.471       95.625
GET      26.239       95.938
GET      27.007       96.250
GET      28.031       96.562
GET      29.055       96.875
GET      29.823       97.031
GET      30.463       97.188
GET      31.231       97.344
GET      32.127       97.500
GET      33.279       97.656
GET      34.303       97.812
GET      35.583       97.969
GET      37.119       98.125
GET      38.655       98.281
GET      40.703       98.438
GET      41.983       98.516
GET      43.519       98.594
GET      45.055       98.672
GET      46.591       98.750
GET      48.639       98.828
GET      50.687       98.906
GET      53.247       98.984
GET      55.551       99.062
GET      58.367       99.141
GET      61.183       99.219
GET      62.719       99.258
GET      64.511       99.297
GET      66.559       99.336
GET      68.095       99.375
GET      70.143       99.414
GET      72.191       99.453
GET      74.239       99.492
GET      76.799       99.531
GET      79.359       99.570
GET      81.407       99.609
GET      82.943       99.629
GET      84.479       99.648
GET      86.015       99.668
GET      87.039       99.688
GET      88.575       99.707
GET      90.111       99.727
GET      91.647       99.746
GET      93.695       99.766
GET      95.743       99.785
GET      97.791       99.805
GET      98.815       99.814
GET      99.839       99.824
GET     101.375       99.834
GET     102.399       99.844
GET     103.935       99.854
GET     105.471       99.863
GET     107.007       99.873
GET     109.055       99.883
GET     110.591       99.893
GET     112.639       99.902
GET     113.663       99.907
GET     114.687       99.912
GET     115.711       99.917
GET     117.247       99.922
GET     118.271       99.927
GET     119.807       99.932
GET     120.831       99.937
GET     122.879       99.941
GET     124.415       99.946
GET     126.463       99.951
GET     127.487       99.954
GET     128.511       99.956
GET     129.535       99.958
GET     130.559       99.961
GET     132.095       99.963
GET     133.119       99.966
GET     134.143       99.968
GET     135.167       99.971
GET     137.215       99.973
GET     138.239       99.976
GET     139.263       99.977
GET     140.287       99.978
GET     141.311       99.979
GET     142.335       99.980
GET     143.359       99.982
GET     144.383       99.983
GET     145.407       99.984
GET     146.431       99.985
GET     148.479       99.987
GET     151.551       99.988
GET     152.575       99.988
GET     153.599       99.989
GET     154.623       99.990
GET     155.647       99.990
GET     156.671       99.991
GET     157.695       99.991
GET     159.743       99.992
GET     160.767       99.993
GET     162.815       99.993
GET     163.839       99.994
GET     165.887       99.994
GET     166.911       99.995
GET     167.935       99.995
GET     168.959       99.995
GET     171.007       99.995
GET     173.055       99.996
GET     174.079       99.996
GET     176.127       99.996
GET     178.175       99.997
GET     180.223       99.997
GET     182.271       99.997
GET     184.319       99.997
GET     189.439       99.997
GET     193.535       99.998
GET     196.607       99.998
GET     198.655       99.998
GET     200.703       99.998
GET     203.775       99.998
GET     207.871       99.998
GET     208.895       99.998
GET     209.919       99.999
GET     209.919       99.999
GET     210.943       99.999
GET     211.967       99.999
GET     214.015       99.999
GET     216.063       99.999
GET     218.111       99.999
GET     219.135       99.999
GET     221.183       99.999
GET     223.231       99.999
GET     233.471       99.999
GET     235.519       99.999
GET     237.567       99.999
GET     237.567       99.999
GET     238.591       99.999
GET     238.591       99.999
GET     240.639      100.000
GET     242.687      100.000
GET     243.711      100.000
GET     244.735      100.000
GET     245.759      100.000
GET     245.759      100.000
GET     245.759      100.000
GET     247.807      100.000
GET     247.807      100.000
GET     247.807      100.000
[...]
GET     248.831      100.000
GET     288.767      100.000
GET     288.767      100.000
GET     290.815      100.000
GET     290.815      100.000
GET     290.815      100.000
GET     301.055      100.000
GET     301.055      100.000
GET     301.055      100.000
[...]
GET     305.151      100.000
GET     305.151      100.000
GET     305.151      100.000
[...]
GET     309.247      100.000
GET     309.247      100.000
GET     309.247      100.000
[...]
GET     311.295      100.000
GET     311.295      100.000
---
WAIT      0.000      100.000